{
    "name": "Twin Peaks Hotel",
    "address": "123 Twin Peaks Road, San Francisco, CA 94114",
    "proximityToAttractions": "Located in the heart of San Francisco, just a short drive from popular tourist attractions such as Golden Gate Park and Union Square.",
    "neighborhoodSafety": "The hotel is situated in a safe neighborhood with low crime rates.",
    "accessibility": "The hotel is easily accessible by public transportation and is wheelchair accessible.",
    "nightlyRate": "$250",
    "hiddenFees": "No hidden fees. All taxes and resort fees are included in the nightly rate.",
    "type": "Luxury",
    "size": "Large",
    "wifi": "Free high-speed WiFi available in all rooms and public areas.",
    "breakfast": "Complimentary continental breakfast served daily.",
    "poolAndSpa": "Private infinity pools available in select rooms.",
    "climateControl": "Individually controlled heating and air conditioning in all rooms.",
    "topAmenity": "Private Infinity Pools",
    "overallRating": "4.5",
    "recentReview": "Amazing hotel with stunning views of the city. The private infinity pool was a highlight of our stay.",
    "serviceAndStaff": "Friendly and attentive staff, always ready to assist with any requests.",
    "cancellation": "Free cancellation up to 48 hours prior to check-in.",
    "checkIn": "Check-in time is 3:00 PM.",
    "checkOut": "Check-out time is 11:00 AM.",
    "restaurant": "On-site restaurant offering a variety of cuisine and panoramic views of San Francisco.",
    "roomService": "24-hour room service available.",
    "familyFriendly": "Family-friendly amenities including cribs and babysitting services.",
    "petPolicy": "Pet-friendly hotel. Small pets allowed for an additional fee.",
    "shuttleService": "Complimentary shuttle service to and from popular tourist attractions.",
    "parking": "Valet parking available for an additional fee.",
    "safetyAndSecurity": "24-hour security and surveillance cameras throughout the property.",
    "specialOffers": "Special offers and packages available for longer stays.",
    "ambianceAndDecor": "Modern and stylish décor with a cozy and inviting atmosphere.",
    "environmentalInitiatives": "The hotel is committed to sustainability and employs eco-friendly practices.",
    "businessAmenities": "Business center with conference rooms and complimentary Wi-Fi for business travelers.",
    "viewAndSurroundings": "Panoramic views of the city skyline and iconic landmarks such as the Golden Gate Bridge.",
    "noiseLevel": "Quiet and peaceful atmosphere.",
    "topAmenityImage": "https://upcdn.io/kW15biq/raw/uploads/2023/10/08/4m7S67fCKD-file.png",
    "weaviate_obj": "df845c17-c210-4e28-a47a-7c3604e5b5a3"
}