{
    "name": "Ghirardelli Square Hotel",
    "address": "1234 Square Street, San Francisco, CA 94109",
    "proximityToAttractions": "Located in the heart of Ghirardelli Square, within walking distance to Fisherman’s Wharf and the Golden Gate Bridge.",
    "neighborhoodSafety": "Safe neighborhood with 24/7 security presence.",
    "accessibility": "Accessible for guests with disabilities, including ramps and elevators.",
    "nightlyRate": "$250",
    "hiddenFees": "No hidden fees.",
    "type": "Luxury hotel",
    "size": "100 rooms",
    "wifi": "Complimentary high-speed WiFi in all areas.",
    "breakfast": "Full breakfast buffet with a variety of options.",
    "poolAndSpa": "Outdoor heated pool and spa for relaxation and enjoyment.",
    "climateControl": "Individually controlled heating and air conditioning in every room.",
    "topAmenity": "Personal Shopping Concierge",
    "overallRating": "4.6/5",
    "recentReview": "Excellent hotel with a great view of the bay.",
    "serviceAndStaff": "Friendly and attentive staff who go above and beyond to exceed guest expectations.",
    "cancellation": "Flexible cancellation policy up to 24 hours prior to arrival.",
    "checkIn": "3:00 PM",
    "checkOut": "11:00 AM",
    "restaurant": "On-site restaurant offering fine dining with a focus on local cuisine.",
    "roomService": "24-hour room service available with a wide selection of dishes.",
    "familyFriendly": "Family-friendly amenities including cribs, high chairs, and childproofing upon request.",
    "petPolicy": "Pet-friendly hotel with designated pet-friendly rooms.",
    "shuttleService": "Complimentary shuttle service to major attractions within the city.",
    "parking": "Valet parking available for an additional fee.",
    "safetyAndSecurity": "State-of-the-art security system ensuring guest safety.",
    "specialOffers": "Special offers available for extended stays and weekend getaways.",
    "ambianceAndDecor": "Modern and elegant decor creating a sophisticated ambiance.",
    "environmentalInitiatives": "Hotel participates in various environmental initiatives to reduce carbon footprint.",
    "businessAmenities": "Fully equipped business center and meeting rooms for corporate events.",
    "viewAndSurroundings": "Rooms with stunning views of the city skyline and the bay.",
    "noiseLevel": "Soundproof rooms for a peaceful and quiet stay.",
    "topAmenityImage": "https://upcdn.io/kW15biq/raw/uploads/2023/10/08/4m7SXcEhBy-file.png",
    "weaviate_obj": "e4a3daeb-0e28-441e-8538-66d2b0664ba1"
}