{
    "name": "Pyramid Palace Hotel",
    "address": "1234 Transamerica Square, San Francisco, CA 94111",
    "proximityToAttractions": "Located in the heart of downtown San Francisco, just a few blocks away from the Transamerica Pyramid and Union Square.",
    "neighborhoodSafety": "The hotel is located in a safe and secure neighborhood with 24-hour security.",
    "accessibility": "Easily accessible by public transportation and major freeways. The hotel also offers valet parking for guests.",
    "nightlyRate": "$300",
    "hiddenFees": "No hidden fees. All charges are transparent and included in the final bill.",
    "type": "Luxury",
    "size": "200 rooms",
    "wifi": "Free high-speed WiFi available in all rooms and public areas.",
    "breakfast": "Complimentary breakfast buffet with a variety of options.",
    "poolAndSpa": "Indoor heated pool and spa available for guests to relax and unwind.",
    "climateControl": "Individual climate control in each room for personalized comfort.",
    "topAmenity": "Luxury Car Service",
    "overallRating": "4.5/5",
    "recentReview": "The Pyramid Palace Hotel exceeded my expectations. The staff was friendly, the room was spacious and luxurious, and the location was unbeatable. Highly recommended!",
    "serviceAndStaff": "Exceptional service from the friendly and attentive staff.",
    "cancellation": "Flexible cancellation policy. Free cancellation up to 24 hours prior to arrival.",
    "checkIn": "Check-in starts at 3:00 PM.",
    "checkOut": "Check-out is at 11:00 AM.",
    "restaurant": "On-site restaurant offering a diverse menu of local and international cuisine.",
    "roomService": "24-hour room service available for guests' convenience.",
    "familyFriendly": "Family-friendly amenities and activities for children.",
    "petPolicy": "Pets are welcome at an additional fee.",
    "shuttleService": "Complimentary shuttle service to major attractions and transportation hubs.",
    "parking": "Valet parking available for guests at an additional charge.",
    "safetyAndSecurity": "24-hour security and surveillance cameras for safety and peace of mind.",
    "specialOffers": "Exclusive offers and discounts available for guests.",
    "ambianceAndDecor": "Elegant and modern decor creating a luxurious and comfortable ambiance.",
    "environmentalInitiatives": "Environmentally friendly practices and initiatives for a sustainable stay.",
    "businessAmenities": "Fully-equipped business center and meeting rooms for conferences and events.",
    "viewAndSurroundings": "Stunning views of the city skyline and the iconic Transamerica Pyramid.",
    "noiseLevel": "Quiet and peaceful atmosphere throughout the hotel.",
    "topAmenityImage": "https://upcdn.io/kW15biq/raw/uploads/2023/10/08/4m7S3fzLBa-file.png",
    "weaviate_obj": "70ac70cc-5c50-4534-b76f-ede936f8346e"
}